<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 //EN">
<HTML>
<HEAD>
<TITLE>MIF-Editor-Hilfe (F&uuml;r Version 1.0)</TITLE>
<STYLE TYPE="text/css">
body {
 font-family: Arial;
 font-size: 20px;
 background: #00FF80;
}
h1 {
 font-size: 50px;
 font-weight: bold;
 text-decoration: underline;
 text-align: center;
 color: #000080;
}
h2 {
 font-size: 40px;
 font-weight: bold;
 text-align: center;
 color: #004000;
}
A {
 text-decoration: underline;
 color: #0000FF;
}
A:hover {
 text-decoration: none;
 color: #008000;
}
A:active {
 text-decoration: underline;
 color: #FF0000;
}
SPAN {
 font-weight: bold;
 color: #FF0000;
 background: #FFFFFF;
}
</STYLE>
</HEAD>

<BODY>
<H1>Hilfe zum MIF-Editor 1.0</H1>
<H2>Inhalt<A name="Inhalt"></A></H2>
<A href="#Inhalt">Inhalt</A><BR>
<A href="#Installation">Installation / Start</A><BR>
<A href="#Erste Schritte">Erste Schritte</A><BR>
<A href="#Farben">Farben / Farbverl&auml;ufe</A><BR>
<A href="#Bilder">Bilder</A><BR>
<A href="#Erweiterte Schritte">Erweiterte Schritte</A><BR>
<A href="#Grenzen dieser Version">Grenzen dieser Version</A><BR>
<A href="#Bugs">Bugs</A>

<H2>Installation / Start<A name="Installation"></A></H2>
Zur Installation den MIF-Editor aus dem Internet herunterladen (ggf. entpacken) und in ein beliebiges Verzeichnis speichern.<BR>
Zum Starten der Software die Datei &quot;MIF-Editor.exe&quot; &ouml;ffnen. (erkennbar an dem Raketensymbol)

<H2>Erste Schritte<A name="Erste Schritte"></A></H2>
Nach dem Starten sehen Sie rechts &quot;Bild 1&quot; bis &quot;Bild 24&quot;. Klicken Sie verschiedene Bilder an. Die gelbe Markierung gibt an, welches Bild Sie gerade markiert haben.<BR>
Rechts oben sehen Sie die Eigenschaften des Bildes. Die Schwarze Schrift k&ouml;nnen Sie genauso anklicken wie die Bilder. Auch hier wird 3in gelber Rahmen angezeigt. Klicken Sie auf &quot;Bildbreite&quot; und geben Sie dort &quot;250&quot; ein. (Sie k&ouml;nnen das Numpad dabei nicht benutzen. Verfahren Sie mit dem Feld &quot;Bildh&ouml;he&quot; genauso.<P>

Sie sehen jetzt unten rechts im Vorschaufenster ein 250 x 250 Pixel gro&szlig;es, schwarzes Rechteck. Klicken Sie zwei mal auf &quot;Farbe 1&quot;. Jetzt &ouml;ffnet sich die Farbauswahlbox und Sie k&ouml;nnen ihre Lieblingsfarbe ausw&auml;hlen und auf &quot;OK&quot; klicken. Das Rechteck hat jetzt diese Farbe &uuml;bernommen.<P>

Klicken Sie zewi mal auf &quot;Speicherart: Farbe&quot; und w&auml;hlen Sie &quot;Farbverlauf (Horizontal)&quot; aus der Liste. Sie sehen jetzt einen Farbverlauf von Ihrer Lieblingsfarbe nach schwarz. Unter &quot;Farbe 2&quot; k&ouml;nnen Sie die Farbe einstellen, zu welcher der Farbverlauf gehen soll. Nehmen Sie eine weitere Farbe, die Ihnen gut gef&auml;llt.<P>

Ihnen wird aufgefallen sein, dass bei dem Bild, dass Sie rechts angeklickt haben, steht: &quot;Farbverlauf (Horizo<FONT COLOR="#40C080">ntal)</FONT>&quot;. Dies ist die Speicherart. Es werden nur Bilder mit Inhalt (Also gr&ouml;&szlig;er al 0 x 0 Pixel) gespeichert. Bei allen Bildern, wo das der Fall ist, wird die Speicherart angezeigt. Dr&uuml;cken Sie nun auf [S] und Speichern Sie das Bild ab.<BR>
Sie haben gerade Ihr erstes MIF-Bild gespeichert. Herzlichen Gl&uuml;ckwunsch.
<H2>Farben / Farbverl&auml;ufe<A name="Farben"></A></H2>
Sie k&ouml;nnen im MIF-Format Farben bzw. Farbverl&auml;ufe als Farbe bzw. Farbverlauf abspeichern. Das bedeutet, das ein Bild mit einer Farbe oder einem Farbverlauf maximal 13 Byte gro&szlig; ist egal wie viele Pixal das Bild hat. Stellen sie dazu &quot;Bildbreite&quot; und &quot;Bildh&ouml;he&quot; auf die gew&uuml;nschte Gr&ouml;&szlig;e ihres Bildes ein. Die Anzahl an Frames sollten Sie dabei auf dem Standartwert &quot;1&quot; belassen. Unter &quot;Speicherart&quot; stellen Sie den gew&uuml;nschten Modus ein und mit &quot;Farbe 1&quot; und &quot;Farbe 2&quot; bestimmen sie die Farbe ihres Bildes.

<H2>Bilder<A name="Bilder"></A></H2>
Stellen Sie zun&auml;chst die &quot;Speicherart&quot; auf ein beliebiges Bild und klicken Sie zwei mal auf &quot;Dateiname&quot;<BR>
Danach laden Sie ein beliebiges Bild von Ihrer Festplatte. Dieses wird danach im Vorschaufenster angezeigt. Als n&auml;chstes stellen Sie die Speicherart ein. Dabei gibt es drei m&ouml;glichkeiten ein Bild einzuf&uuml;gen:<BR>
<OL START="1" TYPE="1">
<LI>Als unkomprimiertes Bild: &Auml;hnlich wie bei Bitmaps. Das Bild verliert keine Informationen aber der Speicherbedarf kann gro&szlig; werden.</LI>
<LI>Als LWZ-Komprimiertes Bild: Diese Kompression fasst gleiche, hintereinander liegende Pixel zusammen. Das Bild wird dabei verlustfrei komprimiert. Diese kompression funktioniert allerdings nicht bei eingescannten Bildern oder Fotos und braucht dann soger noch mehr Speicherplatz wie ein unkomprimiertes Bild.</LI>
<LI>Als YUV-Komprimiertes Bild: Hierbei werden Farbinformationen entfernt, weil das Menschliche Auge diese nicht so gut wahrnehmen kann. Diese kompression reduziert die Datenmenge immer um die H&auml;lfte, jedoch wird die Qualit&auml;t des Bildes geringf&uuml;gig schlechter.</LI>
</OL>
Die richtige Kompression findet man am Besten durch ausprobieren.

<H2>Erweiterte Schritte<A name="Erweiterte Schritte"></A></H2>
Eine Hintergrundfarbe stellen Sie unter &quot;Transparente Farbe&quot; ein. Diese wird dann ausgeschnitten.<BR>
<SPAN>Beachten Sie:</SPAN> Manche Programme unterst&uuml;tzen unter Umst&auml;nden keine transparente Farbe. In diesem Fall bleibt die Einstellung wirkungslos.<P>

Unter &quot;Frames&quot; stellen Sie ein, dass Ihr Bild in mehrere Teile zerlegt wird. Bei manchen Spielen macht man so Animationen.<BR>
<SPAN>Achtung:</SPAN> Dieses Feature ist z.Z. noch nicht ganz ausgereift, sodass Bilder mit mehreren Frames nicht lesbar sein k&ouml;nnen.

<H2>Grenzen dieser Version<A name="Grenzen dieser Version"></A></H2>
<UL>
<LI>Mit dieser Version lassen sich maximal 24 Bilder in einer Datei unterbringen, obwohl das MIF-Format bis zu 65.535 erlaubt.</LI>
<LI>Die Framerate l&auml;sst sich nicht einstellen und ist auf &quot;1&quot; festgelegt.</LI>
<LI>Maximale Bildbreite sowie Bildh&ouml;he sind gem&auml;&szlig; MIF-Format 65.535 Pixel. Die Frameanzahl ist nach dem MIF-Format auf 255 beschr&auml;nkt.</LI>
</UL>

<H2>Bugs<A name="Bugs"></A></H2>
Die Zerlegung in mehrere Frame funktioniert nicht richtig.
</BODY>
</HTML>